perf/delay.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/js/delay'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/py/delay'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery_gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 120
      arrivalRate: 30

scenarios:
  - name: DelayScenario (/)
    flow:
      - get:
          url: '/'